/*
 * defineADC.h
 *
 *  Created on: 2022年12月8日
 *      Author: Jeffery
 */

#ifndef FW_DEFINEADC_H_
#define FW_DEFINEADC_H_


#define INIT_TIME_LIMIT  (uint32_t)(ONE_SECOND*2400)  //初始10A时间40分钟 40x60
#define CURRENT_081_ENTER_TEMP_ENV               30 + 55    /*进入80%降额的环温*/
#define CURRENT_081_EXIT_TEMP_ENV                30 + 45    /*退出80%降额的环温*/
#define PERCENT80 80 
#define PERCENT60 60
#define VPERCENT80 510
#define VPERCENT60 530

#define MAX_LIMITED_VOLTAGE 545
#define MIN_LIMITED_VOLTAGE 420
#define MAX_LIMITED_CURRENT 100
#define MIN_LIMITED_CURRENT 10

#define MIN_LOW_VOLTAGE  39800  //43400  //35800   // 150v欠压保护
#define MAX_HIGH_VOLTAGE 65000  //         285v过压保护

#define ACVEnter1A    MIN_LOW_VOLTAGE+2000   //38500			//160V 欠压保护判断电压异常电流降额至1A
#define ACVExit1A     MIN_LOW_VOLTAGE+3000    //42000			  //175V欠压保护判断电压恢复降额-正常工作

#define MIN_LOW_VOLTAGE_RECOVERY MIN_LOW_VOLTAGE+1200
#define MAX_HIGH_VOLTAGE_RECOVERY MAX_HIGH_VOLTAGE-5000

#define PWM_CURRENT_1A 	135




#if defined( _MAIN_C_)
#define EXT
#else
#define EXT   extern
#endif

/**
 * 0--------降额情况下，判定进入恒压的电流阈值
 * 1--------额定电流下，判定进入恒压的电流阈值
 * 2--------判定进入涓流的电流阈值
 * 3--------判定退出涓流的电流阈值
 * 4--------降额对应的PWM值
 *
 * 5--------恒压恒流的时间
 * 6--------恒压的时间
 * 7--------涓流的时间
 *
 * 8--------进入降额的MOS温度
 * 9--------退出降额的MOS温度
 * 10-------进入降额的环境温度
 * 11-------退出降额的环境温度
 *
 * 12-------OTP的MOS温度
 * 13-------退出OTP的MOS温度
 * 14-------OTP的环境温度
 * 15-------退出OTP的环境温度
 *16--------恒压 涓流 拔掉电池包，电压不会小于多少
 *17--------充电状态下风扇堵转电流
 *18---------风扇保护程序里，风扇堵转电流
 *19--------预设常温电压PWM
 *20--------预设高温电压PWM
 *21--------预设低温电压PWM
 *22--------预设额定电流PWM
 *23--------预设浮充电压PWM
 *24--------风扇保护是否启用
 *25--------风扇堵转保护方法2,堵转电流不小于
 *26--------风扇堵转保护方法2,零计数
 *27--------风扇堵转保护方法2,谷底计数
 *28--------环境OTP保护延时,初次增加此功能是为了解决48v1.8a,60度全额工作与70度必须OTP的矛盾
 *29--------横流充电时间限制,雅迪在60V量产后提出变更
 *30--------客户号+产品电压+电流+版本号(雅迪01,新日02,爱玛03)+(60V_01,48V_02 , 72V_03) + (3A_01 , 1.8A_02 , 4A_03 , 2A_04) + 版本号
 */
EXT const uint32_t keyParam[]
#if defined(_MAIN_C_)

	#if defined (_LIMA48V10A_)
								={	8445			/*0--------降额情况下，判定进入恒压的电流阈值*/ ,
										26400/*28540*/ 			/*1--------额定电流下，判定进入恒压的电流阈值*/,
										6000 - 1040			/* 2--------判定进入涓流的电流阈值*/,
										6200 - 1040			/*3--------判定退出涓流的电流阈值*/,
										535 				/*4--------降额对应的PWM值*/,
										(uint32_t)(ONE_SECOND*3600*10)			/*5--------恒压恒流的时间*/ ,
										(uint32_t)(ONE_SECOND*3600*2.5)		/*6--------恒压的时间*/ ,
										(uint32_t)(ONE_SECOND*3600*2.5)		/*7--------涓流的时间*/,
										30 + 110 /*120*/ 		/*8--------进入降额的MOS温度*/,
										30 + 80 		/*9--------退出降额的MOS温度*/,
										30 + 70 		/*10-------进入降额的环境温度*/,
										30 + 55 		/*11-------退出降额的环境温度*/,

										30 + 110 /*120*/ 		/*12-------OTP的MOS温度*/ ,
										30 + 80		/*13-------退出OTP的MOS温度*/ ,
										30 + 73 		/*14-------OTP的环境温度*/ ,
										30 + 55 		/*15-------退出OTP的环境温度*/,
										219944		/*16--------恒压 涓流 拔掉电池包，电压不会小于多少*/,

										25500          	/*17--------充电状态下风扇堵转电流*/,
										25500              /*18---------风扇保护程序里，风扇堵转电流*/,

										410    /*19--------预设常温电压PWM*/	,
										308    /*20--------预设高温电压PWM*/ ,
										500    /*21--------预设低温电压PWM*/,
										886    /*22--------预设额定电流PWM*/ ,
										125    /*23--------预设浮充电压PWM*/,

										1     /*24--------风扇保护是否启用*/,
										16000  /*25--------风扇堵转保护方法2,堵转电流不小于*/,
										16  /*26--------风扇堵转保护方法2,零计数*/,
										2 /*27--------风扇堵转保护方法2,谷底计数*/,
										1 /*28--------环境OTP保护延时,初次增加此功能是为了解决48v1.8a,60度全额工作与70度必须OTP的矛盾*/,
										(uint32_t)(ONE_SECOND*3600*7.7) /*29--------横流充电时间限制,雅迪在60V量产后提出变更*/,
										0x11E01E01/* *30--------4(客户)+12(电压)+8(电流)+1(类型)+2(保留)+5(版本)*/
								};
								const uint32_t ALLOW_CHARGE_BAT_VOLTAGE=131538;	//48V:27V ;  60v:39V; 72V:47V min电池包电压
								const uint8_t RATED_CURRENT=100; //40x4;	// 4A/0.1
//const uint8_t ADJ_CURRENTx4[]={0,0,0,0,0,2,7,11,16,20,25,29,34,38,43,48,52,57,61,66,
//70,75,79,84,88,93,97,102,106,111,116,120,124,129,133,138,142,147,151,156,160};
const uint16_t ADJ_CURRENTx4[]={								
0,0,0,0,0, 0,0,0,0,0,
4,9,13,18,22, 27,31,36,40,44,
49,53,58,62,67, 71,76,80,84,89,
93,98,102,107,111, 116,120,124,129,133,
138,142,147,151,156, 160,164,169,173,178,
182,187,191,196,200, 204,209,213,218,222,
227,231,236,240,244, 249,253,258,262,267,
271,276,280,284,289, 293,298,302,307,311,
316,320,324,329,333, 338,342,347,351,356,
360,364,369,373,378, 382,387,391,396,400,	
400,400};
								
								#warning 48v10A selected.


	#elif defined( _YADI60V3A_)
								={	9828			/*0--------降额情况下，判定进入恒压的电流阈值*/ ,
										26044 			/*1--------额定电流下，判定进入恒压的电流阈值*/,
										4914 			/* 2--------判定进入涓流的电流阈值*/,
										5208 			/*3--------判定退出涓流的电流阈值*/,
										506 				/*4--------降额对应的PWM值*/,
										(uint32_t)(ONE_SECOND*3600*10)				/*5--------恒压恒流的时间*/ ,
										(uint32_t)(ONE_SECOND*3600*2.5)			/*6--------恒压的时间*/ ,
										(uint32_t)(ONE_SECOND*3600*2.5)			/*7--------涓流的时间*/,
										10+110 				/*8--------进入降额的MOS温度*/,
										10 + 80 				/*9--------退出降额的MOS温度*/,
										10 + 67 				/*10-------进入降额的环境温度*/,
										10+ 55 				/*11-------退出降额的环境温度*/,

										10 + 110 				/*12-------OTP的MOS温度*/ ,
										10 + 80				/*13-------退出OTP的MOS温度*/ ,
										10 + 70 				/*14-------OTP的环境温度*/ ,
										10 + 55 				/*15-------退出OTP的环境温度*/,
										293258			/*16--------恒压 涓流 拔掉电池包，电压不会小于多少*/,

										29536          	/*17--------充电状态下风扇堵转电流*/,
										26000              /*18---------风扇保护程序里，风扇堵转电流*/,

										673    /*19--------预设常温电压PWM*/	,
										558    /*20--------预设高温电压PWM*/ ,
										770    /*21--------预设低温电压PWM*/,
										750    /*22--------预设额定电流PWM*/ ,
										387    /*23--------预设浮充电压PWM*/	,

											1  /*24--------风扇保护是否启用*/,
											16000  /*25--------风扇堵转保护方法2,堵转电流不小于*/,
											16  /*26--------风扇堵转保护方法2,零计数*/,
											2 /*27--------风扇堵转保护方法2,谷底计数*/,
											0 /*28--------环境OTP保护延时,初次增加此功能是为了解决48v1.8a,60度全额工作与70度必须OTP的矛盾*/,
											(uint32_t)(ONE_SECOND*3600*17)	 /*29--------横流充电时间限制,雅迪在60V量产后提出变更*/,
											0x12581e03	/* *30--------4(客户)+12(电压)+8(电流)+1(类型)+2(保留)+5(版本)*/
									};
	#elif defined(_YADI48V1o8A_)
								={	13200			/*0--------降额情况下，判定进入恒压的电流阈值*/ ,
										31980 			/*1--------额定电流下，判定进入恒压的电流阈值*/,
										6160 			/* 2--------判定进入涓流的电流阈值*/,
										6560 			/*3--------判定退出涓流的电流阈值*/,
										380 				/*4--------降额对应的PWM值*/,
										(uint32_t)(ONE_SECOND*3600*10)			/*5--------恒压恒流的时间*/ ,
										(uint32_t)(ONE_SECOND*3600*2.5)		/*6--------恒压的时间*/ ,
										(uint32_t)(ONE_SECOND*3600*2.5)		/*7--------涓流的时间*/,
										10+105 		/*8--------进入降额的MOS温度*/,
										10 + 80 		/*9--------退出降额的MOS温度*/,
										10 + 75 		/*10-------进入降额的环境温度*/,
										10+ 55 		/*11-------退出降额的环境温度*/,

										10 + 105 		/*12-------OTP的MOS温度*/ ,
										10 + 80		/*13-------退出OTP的MOS温度*/ ,
										10 + 78 		/*14-------OTP的环境温度*/ ,
										10 + 55 		/*15-------退出OTP的环境温度*/,
										219944		/*16--------恒压 涓流 拔掉电池包，电压不会小于多少*/,

										26536          	/*17--------充电状态下风扇堵转电流*/,
										27800              /*18---------风扇保护程序里，风扇堵转电流*/,

										820    /*19--------预设常温电压PWM*/	,
										730    /*20--------预设高温电压PWM*/ ,
										920    /*21--------预设低温电压PWM*/,
										950    /*22--------预设额定电流PWM*/ ,
										557    /*23--------预设浮充电压PWM*/,

											1    /*24--------风扇保护是否启用*/,
											16000  /*25--------风扇堵转保护方法2,堵转电流不小于*/,
											16/*欣富邦*/  /*9超频*/   /*26--------风扇堵转保护方法2,零计数*/,
											2/*欣富邦*/ /*6超频*/   /*27--------风扇堵转保护方法2,谷底计数*/,
											1 /*28--------环境OTP保护延时,初次增加此功能是为了解决48v1.8a,60度全额工作与70度必须OTP的矛盾*/,
											(uint32_t)(ONE_SECOND*3600*7.7) /*29--------横流充电时间限制,雅迪在60V量产后提出变更*/,
											0x11e01203	/* *30--------4(客户)+12(电压)+8(电流)+1(类型)+2(保留)+5(版本)*/
								};
								#warning 48v108A selected.

	#elif defined(_YADI72V3A_)
							  ={	9828			/*0--------降额情况下，判定进入恒压的电流阈值*/ ,
								  26044 			/*1--------额定电流下，判定进入恒压的电流阈值*/,
								  4914 			/* 2--------判定进入涓流的电流阈值*/,
								  5208 			/*3--------判定退出涓流的电流阈值*/,
								  506 				/*4--------降额对应的PWM值*/,
								  (uint32_t)(ONE_SECOND*3600*10)				/*5--------恒压恒流的时间*/ ,
								  (uint32_t)(ONE_SECOND*3600*2.5)			/*6--------恒压的时间*/ ,
								  (uint32_t)(ONE_SECOND*3600*2.5)			/*7--------涓流的时间*/,
								  10+115 				/*8--------进入降额的MOS温度*/,
								  10 + 80 				/*9--------退出降额的MOS温度*/,
								  10 + 72 				/*10-------进入降额的环境温度*/,
								  10+ 55 				/*11-------退出降额的环境温度*/,

								  10 + 115 				/*12-------OTP的MOS温度*/ ,
								  10 + 80				/*13-------退出OTP的MOS温度*/ ,
								  10 + 75 				/*14-------OTP的环境温度*/ ,
								  10 + 55 				/*15-------退出OTP的环境温度*/,
								  293258			/*16--------恒压 涓流 拔掉电池包，电压不会小于多少*/,

								  29536          	/*17--------充电状态下风扇堵转电流*/,
								  26000              /*18---------风扇保护程序里，风扇堵转电流*/,

								  800    /*19--------预设常温电压PWM*/	,
								  709    /*20--------预设高温电压PWM*/ ,
								  900    /*21--------预设低温电压PWM*/,
								  999    /*22--------预设额定电流PWM*/ ,
								  650    /*23--------预设浮充电压PWM*/	,

								  1  /*24--------风扇保护是否启用*/,
								  16000  /*25--------风扇堵转保护方法2,堵转电流不小于*/,
								  16  /*26--------风扇堵转保护方法2,零计数*/,
								  2 /*27--------风扇堵转保护方法2,谷底计数*/,
								  1 /*28--------环境OTP保护延时,初次增加此功能是为了解决48v1.8a,60度全额工作与70度必须OTP的矛盾*/,
								  (uint32_t)(ONE_SECOND*3600*17)	 /*29--------横流充电时间限制,雅迪在60V量产后提出变更*/,
								0x12D01E01/* *30--------4(客户)+12(电压)+8(电流)+1(类型)+2(保留)+5(版本)*/
								};
	#elif defined(_YADI60V4A_)
							  ={	9828			/*0--------降额情况下，判定进入恒压的电流阈值*/ ,
								  34349 			/*1--------额定电流下，判定进入恒压的电流阈值*/,
								  6558 			/* 2--------判定进入涓流的电流阈值*/,
								  6858 			/*3--------判定退出涓流的电流阈值*/,
								  406 				/*4--------降额对应的PWM值*/,
								  (uint32_t)(ONE_SECOND*3600*10)				/*5--------恒压恒流的时间*/ ,
								  (uint32_t)(ONE_SECOND*3600*2.5)			/*6--------恒压的时间*/ ,
								  (uint32_t)(ONE_SECOND*3600*2.5)			/*7--------涓流的时间*/,
								  30+115 				/*8--------进入降额的MOS温度*/,
								  30 + 80 				/*9--------退出降额的MOS温度*/,
								  30 + 72 				/*10-------进入降额的环境温度*/,
								  30+ 55 				/*11-------退出降额的环境温度*/,

								  30 + 115 				/*12-------OTP的MOS温度*/ ,
								  30 + 80				/*13-------退出OTP的MOS温度*/ ,
								  30 + 75 				/*14-------OTP的环境温度*/ ,
								  30 + 55 				/*15-------退出OTP的环境温度*/,
								  293258,          //293258			/*16--------恒压 涓流 拔掉电池包，电压不会小于多少*/,

								  29536          	/*17--------充电状态下风扇堵转电流*/,
								  26000              /*18---------风扇保护程序里，风扇堵转电流*/,

								  673    /*19--------预设常温电压PWM*/	,
								  558    /*20--------预设高温电压PWM*/ ,
								  770    /*21--------预设低温电压PWM*/,
								  750    /*22--------预设额定电流PWM*/ ,
								  387    /*23--------预设浮充电压PWM*/	,

								  1  /*24--------风扇保护是否启用*/,
								  16000  /*25--------风扇堵转保护方法2,堵转电流不小于*/,
								  16  /*26--------风扇堵转保护方法2,零计数*/,
								  2 /*27--------风扇堵转保护方法2,谷底计数*/,
								  1 /*28--------环境OTP保护延时,初次增加此功能是为了解决48v1.8a,60度全额工作与70度必须OTP的矛盾*/,
								  (uint32_t)(ONE_SECOND*3600*17)	 /*29--------横流充电时间限制,雅迪在60V量产后提出变更*/,
									0x12582801/* *30--------4(客户)+12(电压)+8(电流)+1(类型)+2(保留)+5(版本)*/
								};

							  const uint32_t ALLOW_CHARGE_BAT_VOLTAGE=180000; //190000;	// 60v:39V; 72V:47V min电池包电压
								const uint8_t RATED_CURRENT=40; //40x4;	// 4A/0.1
//								const uint8_t ADJ_CURRENT[]={0,0,0,0,0,1,2,3,4,5, 6,7,9,10,11,12,13,14,15,16,
//  17,19,20,21,22,23,24,25,26,28, 29,30,31,32,33,34,36,37,38,39,40 } ;	//5V pull up resistor need to be adjusted...
const uint8_t ADJ_CURRENTx4[]={0,0,0,0,0,2,7,11,16,20,25,29,34,38,43,48,52,57,61,66,
70,75,79,84,88,93,97,102,106,111,116,120,124,129,133,138,142,147,151,156,160};
								#warning 60v4A selected.
	#elif defined( _XINRI48V2o0A_)
								={13200			/*0--------降额情况下，判定进入恒压的电流阈值*/ ,
										31980 			/*1--------额定电流下，判定进入恒压的电流阈值*/,
										8441 			/* 2--------判定进入涓流的电流阈值*/,
										8960 			/*3--------判定退出涓流的电流阈值*/,
										380 				/*4--------降额对应的PWM值*/,
										(uint32_t)(ONE_SECOND*3600*10)			/*5--------恒压恒流的时间*/ ,
										(uint32_t)(ONE_SECOND*3600*2.5)		/*6--------恒压的时间*/ ,
										(uint32_t)(ONE_SECOND*3600*2.5)		/*7--------涓流的时间*/,
										10+110 		/*8--------进入降额的MOS温度*/,
										10 + 80 		/*9--------退出降额的MOS温度*/,
										10 + 75 		/*10-------进入降额的环境温度*/,
										10+ 55 		/*11-------退出降额的环境温度*/,

										10 + 110 		/*12-------OTP的MOS温度*/ ,
										10 + 80		/*13-------退出OTP的MOS温度*/ ,
										10 + 78 		/*14-------OTP的环境温度*/ ,
										10 + 55 		/*15-------退出OTP的环境温度*/,
										219944		/*16--------恒压 涓流 拔掉电池包，电压不会小于多少*/,

										26536          	/*17--------充电状态下风扇堵转电流*/,
										27800              /*18---------风扇保护程序里，风扇堵转电流*/,

										820    /*19--------预设常温电压PWM*/	,
										730    /*20--------预设高温电压PWM*/ ,
										920    /*21--------预设低温电压PWM*/,
										950    /*22--------预设额定电流PWM*/ ,
										557    /*23--------预设浮充电压PWM*/,

										1    /*24--------风扇保护是否启用*/,
										16000  /*25--------风扇堵转保护方法2,堵转电流不小于*/,
										16/*欣富邦*/  /*9超频*/   /*26--------风扇堵转保护方法2,零计数*/,
										2/*欣富邦*/ /*6超频*/   /*27--------风扇堵转保护方法2,谷底计数*/,
										1 /*28--------环境OTP保护延时,初次增加此功能是为了解决48v1.8a,60度全额工作与70度必须OTP的矛盾*/,
										(uint32_t)(ONE_SECOND*3600*7.7) /*29--------横流充电时间限制,雅迪在60V量产后提出变更*/,
									0x21E01401	/* *30--------4(客户)+12(电压)+8(电流)+1(类型)+2(保留)+5(版本)*/
								};
	#elif defined(_AIM60V3o0A_)
							  ={9828			/*0--------降额情况下，判定进入恒压的电流阈值*/ ,
								 26044 			/*1--------额定电流下，判定进入恒压的电流阈值*/,
								 6000 			/* 2--------判定进入涓流的电流阈值*/,
								 6500 			/*3--------判定退出涓流的电流阈值*/,
								 380 				/*4--------降额对应的PWM值*/,
								 (uint32_t)(ONE_SECOND*3600*10)			/*5--------恒压恒流的时间*/ ,
								 (uint32_t)(ONE_SECOND*3600*1.6)		/*6--------恒压的时间*/ ,
								 (uint32_t)(ONE_SECOND*3600*1.5)		/*7--------涓流的时间*/,
								 10+110 		/*8--------进入降额的MOS温度*/,
								 10 + 80 		/*9--------退出降额的MOS温度*/,
								 10 + 67 		/*10-------进入降额的环境温度*/,
								 10+ 55 		/*11-------退出降额的环境温度*/,

								 10 + 110 		/*12-------OTP的MOS温度*/ ,
								 10 + 80		/*13-------退出OTP的MOS温度*/ ,
								 10 + 71 		/*14-------OTP的环境温度*/ ,
								 10 + 55 		/*15-------退出OTP的环境温度*/,
								 293258		/*16--------恒压 涓流 拔掉电池包，电压不会小于多少*/,

								 26536          	/*17--------充电状态下风扇堵转电流*/,
								 27800              /*18---------风扇保护程序里，风扇堵转电流*/,

								 820    /*19--------预设常温电压PWM*/	,
								 730    /*20--------预设高温电压PWM*/ ,
								 920    /*21--------预设低温电压PWM*/,
								 950    /*22--------预设额定电流PWM*/ ,
								 557    /*23--------预设浮充电压PWM*/,

								 1    /*24--------风扇保护是否启用*/,
								 16000  /*25--------风扇堵转保护方法2,堵转电流不小于*/,
								 16/*欣富邦*/  /*9超频*/   /*26--------风扇堵转保护方法2,零计数*/,
								 2/*欣富邦*/ /*6超频*/   /*27--------风扇堵转保护方法2,谷底计数*/,
								 1 /*28--------环境OTP保护延时,初次增加此功能是为了解决48v1.8a,60度全额工作与70度必须OTP的矛盾*/,
								 (uint32_t)(ONE_SECOND*3600*7.5) /*29--------横流充电时间限制,雅迪在60V量产后提出变更*/,
								 0x32581E01	/* *30--------4(客户)+12(电压)+8(电流)+1(类型)+2(保留)+5(版本)*/
								};
	#elif defined(_AIM72V3o0A_)
							  ={9828			/*0--------降额情况下，判定进入恒压的电流阈值*/ ,
								 26044 			/*1--------额定电流下，判定进入恒压的电流阈值*/,
								 6000 			/* 2--------判定进入涓流的电流阈值*/,
								 6500 			/*3--------判定退出涓流的电流阈值*/,
								 380 				/*4--------降额对应的PWM值*/,
								 (uint32_t)(ONE_SECOND*3600*10)			/*5--------恒压恒流的时间*/ ,
								 (uint32_t)(ONE_SECOND*3600*1.6)		/*6--------恒压的时间*/ ,
								 (uint32_t)(ONE_SECOND*3600*1.5)		/*7--------涓流的时间*/,
								 10+115 		/*8--------进入降额的MOS温度*/,
								 10 + 80 		/*9--------退出降额的MOS温度*/,
								 10 + 72 		/*10-------进入降额的环境温度*/,
								 10+ 55 		/*11-------退出降额的环境温度*/,

								 10 + 115 		/*12-------OTP的MOS温度*/ ,
								 10 + 80		/*13-------退出OTP的MOS温度*/ ,
								 10 + 75 		/*14-------OTP的环境温度*/ ,
								 10 + 55 		/*15-------退出OTP的环境温度*/,
								 293258		/*16--------恒压 涓流 拔掉电池包，电压不会小于多少*/,

								 26536          	/*17--------充电状态下风扇堵转电流*/,
								 27800              /*18---------风扇保护程序里，风扇堵转电流*/,

								 820    /*19--------预设常温电压PWM*/	,
								 730    /*20--------预设高温电压PWM*/ ,
								 920    /*21--------预设低温电压PWM*/,
								 950    /*22--------预设额定电流PWM*/ ,
								 557    /*23--------预设浮充电压PWM*/,

								 1    /*24--------风扇保护是否启用*/,
								 16000  /*25--------风扇堵转保护方法2,堵转电流不小于*/,
								 16/*欣富邦*/  /*9超频*/   /*26--------风扇堵转保护方法2,零计数*/,
								 2/*欣富邦*/ /*6超频*/   /*27--------风扇堵转保护方法2,谷底计数*/,
								 1 /*28--------环境OTP保护延时,初次增加此功能是为了解决48v1.8a,60度全额工作与70度必须OTP的矛盾*/,
								 (uint32_t)(ONE_SECOND*3600*7.5) /*29--------横流充电时间限制,雅迪在60V量产后提出变更*/,
								 0x32D01E01	/* *30--------4(客户)+12(电压)+8(电流)+1(类型)+2(保留)+5(版本)*/
								};

	#endif
#else
							;
#endif
								

#define ADV_CHARGING_CURRENT_081_ENTER_TEMP_ENV          ((uint32_t)	ntcAdcENV[CURRENT_081_ENTER_TEMP_ENV] )     
#define ADV_CHARGING_CURRENT_081_EXIT_TEMP_ENV           ((uint32_t)	ntcAdcENV[CURRENT_081_EXIT_TEMP_ENV] )   
								

#define EN_ACTIVE_OTP keyParam[28]
/*AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA*/
//#define TIME_REDUCTION				/*要用加速测试*/
//#define FAN_CUR_TABLE				/*要打印风扇电流数据表*/
#define FAN_BLOCK_WAY2				/*要用方式2检测风扇堵转*/
#ifdef TIME_REDUCTION
/***
 * 加速程序,用于快速测试
 */
#define CC_CV_TIME_LIMIT   (uint32_t)(ONE_SECOND*360 * 2)  /*12分钟恒压恒流*/
#define CV_TIME_LIMIT      (uint32_t)(ONE_SECOND*360)      /*6分钟恒压*/
#define TC_TIME_LIMIT      (uint32_t)(ONE_SECOND*360)       /*6分钟恒流*/

#else
/***
 * 正常程序
 */
#define CC_CV_TIME_LIMIT  keyParam[5] /*(uint32_t)(ONE_SECOND*3600*10)*/
#define CV_TIME_LIMIT      keyParam[6] /*(uint32_t)(ONE_SECOND*3600*2.5)*/
#define TC_TIME_LIMIT      keyParam[7] /*(uint32_t)(ONE_SECOND*3600*2.5)*/
#define CC_TIME_LIMIT      keyParam[29]  /*(uint32_t)(ONE_SECOND*3600*7)*/
#endif
/*VVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVV*/

extern const uint32_t ntcAdcENV[];
#define ADV_FAN_BLOCKING_CURRENT    keyParam[17]  /*29536*/
//#define ADV_FAN_BLOCKING_CURRENT    80000  /*29536*/
#define ADV_FAN_BLOCKING_CURRENT_PROTECTED    keyParam[18]
#define ADV_FAN_MINI_CURRENT        6290
#define FAN_PROTECT_ENABLE           keyParam[24]
#define FAN_BLOCKING_MIN_CURREENT    keyParam[25]   /*25--------风扇堵转保护方法2,堵转电流不小于*/
#define FAN_ZERO_COUNT					keyParam[26]   /*26--------风扇堵转保护方法2,零计数*/
#define FAN_VALLEY_COUNT							keyParam[27]  /*27--------风扇堵转保护方法2,谷底计数*/
#define ADV_AT_LEAST_IF_PACK_FULL          keyParam[16]

#define ADV_CHARGING_CURRENT_ENTER_CONSTANT_VOLTAGE_AT_DERATE     keyParam[0]   /*13760*/     /**改**/
#define ADV_CHARGING_CURRENT_ENTER_CONSTANT_VOLTAGE       keyParam[1] /* 30467*/		               /*改*/  /*电流小于这个值，进入恒压, 这个电流值，应该小于降额工作的电流*/
#define ADV_CHARGING_CURRENT_ENTER_TRI                                  keyParam[2] /* 6160 */                      /*改*/  /*电流小于这个值，进入涓流  0.53  ----  0.48*/
#define ADV_CHARGING_CURRENT_EXIT_TRI         							keyParam[3]  /*	6560 */                      /*改*/
					/*低温补偿最大电压AD值，对应-10℃  75.075V*/
					/*高温补偿最大电压AD值，对应45℃   71.7V*/
#define ADV_BAT_VOLTAGE_AT_25T				360708   	/*25℃对应的电压AD值，  73.5V*/


#define ADV_CURRENT_OFFSET                1040
#define ADV_NTC_OPEN          925664

#define ADV_CHARGING_CURRENT_0o5_ENTER_TEMP_MOS              ( (uint32_t)	ntcAdcENV[ keyParam[8] ])    /*115充电电流降额时对应的mos管温度AD值*/
#define ADV_CHARGING_CURRENT_0o5_ENTER_TEMP_ENV               ((uint32_t)	ntcAdcENV[keyParam[10]] )   /*68充电电流降额时对应的环境温度AD值*/
#define ADV_CHARGING_CURRENT_0o5_EXIT_TEMP_MOS                 ((uint32_t)	ntcAdcENV[keyParam[9]] )   /*80退出充电电流降额对应的MOS管温度AD值*/
#define ADV_CHARGING_CURRENT_0o5_EXIT_TEMP_ENV                   ((uint32_t)	ntcAdcENV[keyParam[11]] )  /*55退出充电电流降额对应的环境温度AD值*/

#define ADV_CHARGING_PROTECT_ENTER_TEMP_MOS              ( (uint32_t)	ntcAdcENV[keyParam[12]])        /*115关断充电时对应的MOS管温度AD值*/
#define ADV_CHARGING_PROTECT_ENTER_TEMP_ENV               ((uint32_t)	ntcAdcENV[keyParam[14] ])     /*73关断充电时对应的环境温度AD值*/
#define ADV_CHARGING_PROTECT_EXIT_TEMP_MOS               ((uint32_t)	ntcAdcENV[keyParam[13] ] )    /*80退出充电保护时对应的MOS'管温度AD值*/
#define ADV_CHARGING_PROTECT_EXIT_TEMP_ENV                ((uint32_t)	ntcAdcENV[keyParam[15]] )     /*55退出充电保护时对应的环境温度AD值*/
//#define SHUT_OFF_DELAY                        ((uint32_t)	keyParam[28] )
#define IS_TEMP_HIGHER_THAN(ntcAd ,threshold)                          ((ntcAd) < (threshold))
#define IS_TEMP_LOWER_THAN(ntcAd ,threshold)                          ((ntcAd) > (threshold))

#define FW_RECOGNIZE        ( keyParam[30]  )    
#endif /* FW_DEFINEADC_H_ */
